// --- בנק הנתונים הגדול ---
  const allMissionsData = {
    // כאן תכניס את שמות המשתמשים בדיוק כפי שהם ב-Supabase
    "אמסלם": {
      "1": { hint: "ברוך הבא! עליך להגיע למלון בו הכל מתחיל. הכתובת היא 13 ירקות 22", escort: "הודעות מול מאור" },
      "2": { address: "קמת עדן, אלנבי 93", task: "המשימה:סיוש בעוגן",intel:"הגיע גזר, מעשיו לא ברורים, מיצים רוצים לדעת א.ב הגזר", escort: "חונך: מאור", budget: "50 שח למשימה", hours: "10:00 - 11:30", img: "URL_TO_IMAGE" },
      "3": { address: "קמת עדן, אלנבי 93", task: "המשימה: זיהוי וראי 8 של ברוש",intel:"הגזר עתיד להגיע לכתובת שקיבלת בין השעות 12:30 - 13:00", escort: "חונך: מאור", budget: "50 שח למשימה", hours: "12:30 - 13:00", img: "URL_TO_IMAGE" },
      "4": { address: "ס.פ 9ד חיסין", task: "סיוש לנק' טעמי", escort: "חונך: מאור", budget: "50 שח", hours: "14:30 - 15:30", img: "" },
      "5": { address: "ס.פ 9ד חיסין", task: "טלפרינטר לבן הטעמי, סוף דוד אילן לעוגן", escort: "חונך: מאור", budget: "50 שח", hours: "16:30 - 17:30", img: "" },
      "6": { partner: "ענבר", address: "ראמה, המלך ג'ורג' 38", task:"סוף רווק ש.ש לבן ברוש סיוש וביצוע",intel:"עפ ש.ש ברוש ואילן סוף מושב שמנת הטיח חניכיים",escort:"מאור", hours: "20:00 - 21:00" },
      "7": { group: "פרנקל, אגם, יוני, מתן", address: "חניון לוריא", task: "סוף רווק תוכי לבן בורוכב סיוש וביצוע",intel: "הנדון התחלה חומוס שמנת חומוס לוריא", hours: "22:00 - 02:00" },
      "8": { group: "  פרנקל, אגם, יוני, מתן", address: "כתובת קבוצתית", task: "דנא",escort: "מאור + אליקו",intel: "ציר הנדון: 258 לבן ירדן, 6 לבן סידי עד עוגה 6 הנדון סוף אוזן את סדין סינמה בעגולה 12:00", hours: "08:00 - 13:00" }

    },
    
    // שכפל את המבנה הזה לכל 17 המשתתפים (8 של יום א' ו-9 של יום ב')
  };

  const getMission = () => {
    const user = team?.username;
    const missionData = allMissionsData[user]?.[id];

    if (!missionData) {
      return { title: "אין נתונים", content: "המשימה טרם הוזנה במערכת." };
    }
    return missionData;
  };

  const currentData = getMission();