export const STATION_PASSWORDS = {
  "1": "התחלה",
  "2": "7766",
  "3": "מפתח",
  "4": "סנטר",
  "5": "שרונה",
  "6": "קפה",
  "7": "מבצע",
  "8": "סיום"
};

export const allMissionsData = {
  "פרנקל": {
    "7": { 
      group: "צוות אדום", 
      address: "חניון המגדל קומה 2-", 
      intel: "קוד כניסה לשרת: 1234. יש להמתין לאות מהמנטור.", 
      task: "פריצה למערכת הנתונים", 
      escort: "טכנאי שטח", 
      hours: "22:00", 
      img: "/missions/hisin.png", 
      map: "מגדל עזריאלי שרונה" 
    },
    // כאן תוסיף את תחנות 1-8 של פרנקל
  },
  "ישראל": {
     "1": { task: "משימה ראשונה לישראל", address: "בן גוריון 1" }
     // ...
  },
  // כאן יבואו כל 17 המשתתפים
};

export const groupsData = {
  "צוות אדום": {
    "7": { participants: "פרנקל, אברהם, משה" }
  }
};